function [S1, S2, Rd, Vd] = signal_target4(EQ64, EQ256)
    c = 3*10^8; %скорость света
    B = 50*10^6; %полоса модул€ции в √ц
    fm = 8*10^3; %частота повторени€ пилы в √ц    
    tau = 1300*10^-9; %задержка сигнала до максимальной дальности в м
    f0 = 24e9; %несуща€ частота
    
    Tm = 1/fm; %период повторени€ пилы
    fb = B*tau/Tm; %дальностна€ частота до максимальной дистанции
    Rd = c/(2*B); %разрешение по дальности
    Vd = (fm*c)/(2*EQ64*f0);  %разрешение по скорости
    tk = 5*10^-9; %временной коэффициент
    I = Tm/tk; %количество отсчетов в одном периоде пилы
      
     % ÷≈Ћ№ 1
    fd1 = -2000; %частота доплера    
    R1 = 320; %дальность до цели
    tau1 = 2*R1/c; %
    fb1 = B*tau1/Tm; %
    J1 = tau1/tk; %задержка в осчетах модели

    % ÷≈Ћ№ 2
    fd2 = 1000; %частота доплера
    R2 = 200;
    tau2 = 2*R2/c;
    fb2 = B*tau2/Tm;
    J2 = tau2/tk;
    
    % ÷≈Ћ№ 3
    fd3 = -3000; %частота доплера
    R3 = 50;
    tau3 = 2*R3/c;
    fb3 = B*tau3/Tm;
    J3 = tau3/tk;
    
    % ÷≈Ћ№ 4
    fd4 = 3000; %частота доплера
    R4 = 150;
    tau4 = 2*R4/c;
    fb4 = B*tau4/Tm;
    J4 = tau4/tk;

    %ћодель сигнала
    b = B/Tm; %коэффициент Ћ„ћ
    FF = EQ64; %количество накапливаемых периодов
    mu=0; %мат.ожидание
    sigma=0.1; %— ќ
    RAND=(mu+sigma.*randn(1,1));
    %1 канал
    for i=0:1:I-1
        for j = 0:1:FF-1
            ZOND(i+1,j+1) = sin(2*pi*tk*i*f0 + pi*b*(i*tk)^2); %модель зондирующего сигнала        
            
            S1_RX(i+1,j+1) = sin(2*pi*(i+J1)*tk*f0 + pi*b*((i+J1)*tk)^2 + 2*pi*fd1*j*Tm + (mu+sigma.*randn(1,1))) + RAND; %модель прин€того сигнала ÷≈Ћ№ 1
            S1_RX(i+1,j+1) = S1_RX(i+1,j+1) + sin(2*pi*(i+J2)*tk*f0 + pi*b*((i+J2)*tk)^2 + 2*pi*fd2*j*Tm + (mu+sigma.*randn(1,1))) + RAND; %модель прин€того сигнала ÷≈Ћ№ 2  
            S1_RX(i+1,j+1) = S1_RX(i+1,j+1) + sin(2*pi*(i+J3)*tk*f0 + pi*b*((i+J3)*tk)^2 + 2*pi*fd3*j*Tm + (mu+sigma.*randn(1,1))) + RAND; %модель прин€того сигнала ÷≈Ћ№ 3  
            S1_RX(i+1,j+1) = S1_RX(i+1,j+1) + sin(2*pi*(i+J4)*tk*f0 + pi*b*((i+J4)*tk)^2 + 2*pi*fd4*j*Tm + (mu+sigma.*randn(1,1))) + RAND; %модель прин€того сигнала ÷≈Ћ№ 4  
                        
            S1_SM(i+1,j+1)=(ZOND(i+1,j+1)*S1_RX(i+1,j+1)); %модель сигнала с выхода смесител€
        end;
    end;
    
    rsm_p = 2; % нужно дл€ преобразовани€ сигнала в EQ256 отсчетов
    rsm_q = double(int16(rsm_p*size(S1_SM,1)/EQ256));
    S1=resample(S1_SM,rsm_p,rsm_q); % пересчет (дискретизаци€) сигнала
    %S1(:,:)=0;    
    while (size(S1,1) > EQ256) % если пересчет дал больше 256 точек
        S1(size(S1,1),:) = []; %модель сигнала после ј÷ѕ
    end;

    %2 канал
    f_1=pi*10/180;
    fi2=f_1;
    l=sqrt(-1);
    for i=0:1:I-1
        for j = 0:1:FF-1
        %ћќƒ≈Ћ№ «ќЌƒ»–”ёў≈√ќ —»√ЌјЋј “ј ∆≈
        S2_RX(i+1,j+1) = exp(l*fi2)*sin(2*pi*(i+J1)*tk*f0 + pi*b*((i+J1)*tk)^2 + 2*pi*fd1*(j)*Tm+RAND)+RAND; %модель прин€того сигнала ÷≈Ћ№ 1
        S2_RX(i+1,j+1) = S2_RX(i+1,j+1) + exp(l*fi2)*sin(2*pi*(i+J2)*tk*f0 + pi*b*((i+J2)*tk)^2 + 2*pi*fd2*(j)*Tm+RAND)+RAND; %модель прин€того сигнала ÷≈Ћ№ 2 
        S2_RX(i+1,j+1) = S2_RX(i+1,j+1) + exp(l*fi2)*sin(2*pi*(i+J3)*tk*f0 + pi*b*((i+J3)*tk)^2 + 2*pi*fd3*(j)*Tm+RAND)+RAND; %модель прин€того сигнала ÷≈Ћ№ 3
        S2_RX(i+1,j+1) = S2_RX(i+1,j+1) + exp(l*fi2)*sin(2*pi*(i+J4)*tk*f0 + pi*b*((i+J4)*tk)^2 + 2*pi*fd4*(j)*Tm+RAND)+RAND; %модель прин€того сигнала ÷≈Ћ№ 4
        
        S2_SM(i+1,j+1)=(ZOND(i+1,j+1)*S2_RX(i+1,j+1)); %модель сигнала с выхода смесител€
        end;
    end;
    rsm_p = 2; % нужно дл€ преобразовани€ сигнала в EQ256 отсчетов
    rsm_q = double(int16(rsm_p*size(S2_SM,1)/EQ256));
    S2=resample(S2_SM,rsm_p,rsm_q); % пересчет (дискретизаци€) сигнала
    %S2(:,:)=0;
    while (size(S2,1) > EQ256) % если пересчет дал больше 256 точек
        S2(size(S2,1),:) = []; %модель сигнала после ј÷ѕ
    end;
end
